In [4]:
import pandas as pd
data = {
    "name": ["amit", "sana", "ravi", "tine"],
    "age": [25, 30, 23, None],
    "city": ["delhi", "mumbai", None, "Bangalore"],
}

In [5]:
df = pd.DataFrame(data)
df

   name   age       city
0  amit  25.0      delhi
1  sana  30.0     mumbai
2  ravi  23.0       None
3  tine   NaN  Bangalore

In [6]:
df.isnull()

    name    age   city
0  False  False  False
1  False  False  False
2  False  False   True
3  False   True  False

In [7]:
df.isnull().sum()

name    0
age     1
city    1
dtype: int64

In [17]:
df.fillna({"age":0,"city":"unknow"},inplace=True)

In [18]:
df

   name   age       city
0  amit  25.0      delhi
1  sana  30.0     mumbai
2  ravi  23.0     unknow
3  tine   0.0  Bangalore

In [20]:
df.rename(columns={"city":"location"},inplace=True)

In [21]:
df

   name   age   location
0  amit  25.0      delhi
1  sana  30.0     mumbai
2  ravi  23.0     unknow
3  tine   0.0  Bangalore

In [24]:
df.drop(3,inplace=True)

In [25]:
df

   name   age location
0  amit  25.0    delhi
1  sana  30.0   mumbai
2  ravi  23.0   unknow

In [27]:
df["salary"] = [30000,50000,60000]

In [28]:
df["after 5 years"]  = df["age"] +5

In [29]:
df

   name   age location  salary  after 5 years
0  amit  25.0    delhi   30000           30.0
1  sana  30.0   mumbai   50000           35.0
2  ravi  23.0   unknow   60000           28.0